#+STARTUP: showall
#+STARTUP: lognotestate
#+TAGS:
#+SEQ_TODO: TODO STARTED DONE DEFERRED CANCELLED | WAITING DELEGATED APPT
#+DRAWERS: HIDDEN STATE
#+TITLE: programming by assertions
#+CATEGORY: 
#+PROPERTY: header-args:sql             :engine postgresql  :exports both :cmdline csc370
#+PROPERTY: header-args:sqlite          :db /path/to/db  :colnames yes
#+PROPERTY: header-args:C++             :results output :flags -std=c++14 -Wall --pedantic -Werror
#+PROPERTY: header-args:R               :results output  :colnames yes



* Assertions in C++

assert evaluates an expression. If the expression fails, the program outputs the location of the failed assertion.

Assertion failed: expression, file filename, line line number

- source file of the failure
- line number of the failure
- name of the function of the failure

It can be used to stop execution of a program

#+BEGIN_SRC C++ :main no :flags -std=c++14 -Wall --pedantic -Werror :results output :exports both
#include <iostream>
#include <cassert> 

void f()
{
   assert(10 < 1);
}

int main()
{
   assert(true);
   f();
   return 0;
}
#+END_SRC

#+RESULTS:
==test.cpp:10: test.cpp:10: int main(): Assertion `10 < 1' failed.

#+BEGIN_SRC C++ :main no :flags -std=c++14 -Wall --pedantic -Werror :results output :exports both
#include <iostream>
#include <cassert> 
#include <vector> 

int divide(int n, int d)
{
    assert(d != 0);
    return n / d;
}

int main()
{
   divide(3,2);
   divide(3,0);
   return 0;
}
#+END_SRC

#+RESULTS:
/tmp/test.cpp:10: int divide(int, int): Assertion `d != 0' 
failed.

